"""
4. Программа принимает действительное положительное число x и целое отрицательное число y.
Необходимо выполнить возведение числа x в степень y.
Задание необходимо реализовать в виде функции my_func(x, y).
При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
Подсказка: попробуйте решить задачу двумя способами.
Первый — возведение в степень с помощью оператора **.
Второй — более сложная реализация без оператора **, предусматривающая использование цикла.
"""


def my_func(a: float, b: int):
    res = 1
    for i in range(abs(b)):
        res *= a
    return a ** b, 1 / res


x = float(input('Enter a valid positive number (x): '))
y = int(input('Enter a negative integer (y): '))
stars, no_stars = my_func(x, y)
print(f'x to the power of y is: {stars} - with **, {no_stars} - without **')
